# Напишите программу, которая принимает на вход координаты двух точек и 
# находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

x1 = float(input('Введите координату х первой точки    '))
y1 = float(input('Введите координату y первой точки    '))
x2 = float(input('Введите координату х второй точки    '))
y2 = float(input('Введите координату y второй точки    '))

d = (x1-x2)*(x1-x2)+(y1-y2)*(y1-y2)
import math
d = math.sqrt(d)
print(d)